// vi エディタ

/*
【i】【a】  インサートモードに切り替える
【ESC】 インサートモードから抜ける
【h】  左へ移動
【j】  下へ移動
【k】  上へ移動
【l】  右へ移動
【0】  カレント行の行頭へ移動
【$】  カレント行の行末へ移動
【Ctrl + f】  次のページへ移動
【Ctrl + b】  前のページへ移動
【gg】  文書頭へ移動 (1行目)
【G】  文書末へ移動 (最終行)
【x】  1文字削除
【dd】  1行削除
【yy】  1行コピー
【nyy】  n行コピー
【p】  カーソルの文字の次または次の行にペースト
【P】  カーソルの文字の前または前の行にペースト
【u】  カット、ペーストを一回取り消し(アンドゥ)
【】
【】


【行番号を指定して移動】
  例) :10 
    10行目へ移動


【ファイルを開く】
  vi ファイル名


【ファイルを閉じる】
  ESCキー → :q (qはquitの略)


【ファイルを保存】
  ESCキー → :w (wはwriteの略)


【ファイルを保存し終了】
  ESCキー → :wq


【ファイルを保存せずに強制終了】
  ESCキー → :q!

【文字列を検索】
  / 文字列


【】
【】
【】
【】
【】
【】
【】